In [3]:
import pandas as pd

In [5]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj2 = pd.Series([4,7,-5,3], index=['a','b','c','d'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [6]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
obj2.dtype

dtype('int64')

In [9]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], ['서울','부산','인천','대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [10]:
s.name = "인구"
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [11]:
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [12]:
s/1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [13]:
s[1]

3448737

In [14]:
s['부산']

3448737

In [15]:
s[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [16]:
s>=2500000

도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [17]:
s[s>=2500000]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [18]:
s[s<=5000000]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [25]:
s[(s>=2500000) & (s<=5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [26]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [59]:
s["부산":"인천"]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [31]:
data = {"서울":9631482, "부산":3393191, "인천":2632035, "대전":1490158}
data

{'서울': 9631482, '부산': 3393191, '인천': 2632035, '대전': 1490158}

In [33]:
s2 = pd.Series(data)
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [34]:
s-s2

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [36]:
ds = s-s2
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [41]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [45]:
rs = (s-s2)/s2*100

In [46]:
rs["부산"] = 1.6
rs["대구"] = 1.41
rs

대구    1.410000
대전         NaN
부산    1.600000
서울    2.832690
인천    9.818107
dtype: float64

In [48]:
del rs["서울"]

KeyError: '서울'

In [49]:
rs

대구    1.410000
대전         NaN
부산    1.600000
인천    9.818107
dtype: float64

In [4]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774]
}
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2431774]}

In [5]:
df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [6]:
df.index = ["서울", "부산", "인천", "대구"]
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [7]:
df.T

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [77]:
data = {
    "키" : [175.3, 180.2, 178.6],
    "몸무게" : [66.2, 78.9, 55.1],
    "나이" : [27.0, 49.0, 35.0]
}
data

df =pd.DataFrame(data)
df

df.index = ["홍길동", "김사또", "임꺽정"]
df

df.T

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

In [8]:
df.values

array([[9904312, 9631482],
       [3448737, 3393191],
       [2890451, 2632035],
       [2466052, 2431774]], dtype=int64)

In [9]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [10]:
df.columns

Index(['2015', '2010'], dtype='object')

In [11]:
df["2010"]

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [13]:
df[["2010"]]

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [15]:
df[["2015", "2010"]]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [16]:
df["2005"] = [9762546, 3512547, 2517680, 2456016]
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [17]:
df[0:1]

       2015     2010     2005
서울  9904312  9631482  9762546

In [19]:
df["서울":"인천"]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [20]:
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [21]:
df.loc["서울", "2015"]

9904312

In [23]:
df.iloc[0:1,0:1]

       2015
서울  9904312

In [30]:
data = pd.read_csv("data/dataset-master/population_number.csv", index_col="도시", encoding="euc-kr")
data

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [31]:
data.count()

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

In [34]:
data["2010"].sort_values(ascending=False)

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [37]:
score = pd.read_csv("data/dataset-master/score.csv", index_col="과목", encoding="euc-kr")
score

   과목  1반  2반  3반  4반
0  수학  45  44  73  39
1  영어  76  92  45  69
2  국어  47  92  45  69
3  사회  92  81  85  40
4  과학  11  79  47  26